---
type: ExternalServiceRegistry
namespace: Autodesk.Revit.DB.ExternalService
version: 2024
members: 4
tags: [revit-api, class]
---

# ExternalServiceRegistry

`Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | ExecuteService | — | `` |
| Method | GetService | 2013 | `public static ExternalService GetService ( ExternalServiceId serviceId )` |
| Method | GetServices | 2013 | `public static IList < ExternalService > GetServices ()` |
| Method | RegisterService | — | `` |